{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "d9976a5e",
   "metadata": {},
   "source": [
    "**Задание №2**"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ab40b2f9",
   "metadata": {},
   "source": [
    "Алгоритмы на строках:\n",
    "\n",
    "1. Поиск подстроки (5 баллов)\n",
    "\n",
    "Дано две строки S и T. Требуется найти индексы всех входжений строки T в строку S.\n",
    "\n",
    "\n",
    "\n",
    "Формат ввода\n",
    "\n",
    "В первой строке ввода задана строка S. Во второй строке ввода задана строка T. Строки содержат только маленькие латинские буквы, длины строк - натуральные числа, не превосходящие 50000.\n",
    "\n",
    "\n",
    "\n",
    "Формат вывода\n",
    "\n",
    "В порядке возрастания выведите все индексы, начиная с которых строка T входит в строку S.\n",
    "\n",
    "\n",
    "Пример:\n",
    "\n",
    "\n",
    "Ввод                         Вывод\n",
    "\n",
    "ababbababa             0 5 7\n",
    "\n",
    "aba"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "id": "ffabc0d6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "val_t asdasdasd 9\n",
      "val_s asd 3\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[0, 3, 6]"
      ]
     },
     "execution_count": 77,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def find_index(val_t, val_s):\n",
    "    \n",
    "    s_len = len(val_s)\n",
    "    res_indexes = []\n",
    "\n",
    "    if len(val_s) > len(val_t): #если val_s больше val_t, то нет смысла пытаться искать вхождения\n",
    "        return None\n",
    "    \n",
    "    if len(val_t) > 50000 or s_len > 50000:\n",
    "        raise ValueError(\"По условию: длины строк - натуральные числа, не превосходящие 50000\")\n",
    "    \n",
    "    if not val_t.isalpha() or not val_t.islower() or not val_s.isalpha() or not val_s.islower():\n",
    "        raise ValueError(\"Строка должна содержать только маленькие латинские буквы\")\n",
    "    \n",
    "    for value in range(0, len(val_t)+1):\n",
    "        if val_s == val_t[value: value + s_len]:\n",
    "            res_indexes.append(value)\n",
    "    return res_indexes\n",
    "\n",
    "\n",
    "val_t = input(\"Введите строку T:\")\n",
    "\n",
    "print('val_t', val_t, len(val_t))\n",
    "\n",
    "val_s = input(\"Введите строку S\")\n",
    "print('val_s', val_s, len(val_s))\n",
    "\n",
    "val_s_indexes = find_index(val_t, val_s)\n",
    "\n",
    "val_s_indexes"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "47d1c951",
   "metadata": {},
   "source": [
    "2. Циклический сдвиг (5 баллов)\n",
    "\n",
    "Дано две строки S и T одинаковой длины. Требуется проверить, является ли строка T является циклическим строки S, и вывести минимальный возможный размер сдвига вправо или -1, если строка T не является циклическим сдвигом строки S.\n",
    "\n",
    "Формат ввода\n",
    "\n",
    "В первой строке ввода задана строка S. Во второй строке ввода задана строка T. Строки содержат только маленькие латинские буквы, длины строк - натуральные числа, не превосходящие 50000.\n",
    "\n",
    "Формат вывода\n",
    "\n",
    "По данным строкам выведите минимальный возможный размер сдвига вправо или -1, если строка T не является циклическим сдвигом строки S.\n",
    "\n",
    "Пример:\n",
    "\n",
    "Ввод     Вывод\n",
    "a             -1\n",
    "b\n",
    "\n",
    "Ввод         Вывод\n",
    "zabcd        4\n",
    "abcdz\n",
    "\n",
    "\n",
    "(zabcd -> dzabc -> cdzab -> bcdza -> abcdz)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "id": "d3c8a614",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "val_t zabcd 5\n",
      "val_s abcdz 5\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "def cycle_d(val_t, val_s):\n",
    "    s_len = len(val_s)\n",
    "    res_indexes = []\n",
    "\n",
    "    if len(val_s) > len(val_t) or len(val_t) > len(val_s):\n",
    "        raise ValueError(\"Строки должны быть одинаковой длинны\")\n",
    "\n",
    "    if len(val_t) > 50000 or s_len > 50000:\n",
    "        raise ValueError(\"По условию: длины строк - натуральные числа, не превосходящие 50000\")\n",
    "    \n",
    "    if not val_t.isalpha() or not val_t.islower() or not val_s.isalpha() or not val_s.islower():\n",
    "        raise ValueError(\"Строка должна содержать только маленькие латинские буквы\")\n",
    "\n",
    "    for k in range(len(val_t)):\n",
    "        t = val_s[k:] + val_s[:k] #сдвиг на k символов\n",
    "\n",
    "        if t == val_t:\n",
    "            return k\n",
    "\n",
    "    return '-1' # в случае, если строка T НЕ является циклическим строки S\n",
    "\n",
    "val_t = 'zabcd'\n",
    "# input(\"Введите строку T:\")\n",
    "\n",
    "print('val_t', val_t, len(val_t))\n",
    "\n",
    "val_s = 'abcdz'\n",
    "# input(\"Введите строку S\")\n",
    "print('val_s', val_s, len(val_s))\n",
    "\n",
    "val_s_indexes = cycle_d(val_t, val_s)\n",
    "\n",
    "print(val_s_indexes)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
